CONFIG = {
    "kill_action": 6,  # 和棋回合数
    "dirichlet": 0.3,  # 国际象棋，0.3；日本将棋，0.15；围棋，0.03
    "play_out": 1200,  # 每次移动的模拟次数
    "c_puct": 5,  # u的权重
    "buffer_size": 100000,  # 经验池大小
    "pytorch_model_path": "model.pth",  # pytorch模型路径
    "train_data_buffer_path": "train_data_buffer.pkl",  # 数据容器的路径
    "batch_size": 512,  # 每次更新的train_step数量
    "kl_targ": 0.02,  # kl散度控制
    "epochs": 5,  # 每次更新的train_step数量
    "game_batch_num": 3000,  # 训练更新的次数
    "use_frame": "pytorch",  # paddle or pytorch根据自己的环境进行切换
    "train_update_interval": 600,  # 模型更新间隔时间
}

# ==========================================================================================
# Layer (type:depth-idx)                   Output Shape              Param #
# ==========================================================================================
# Network                                  [512, 82]                 --
# ├─ConvBlock: 1-1                         [512, 192, 9, 9]          192
# │    └─Conv2d: 2-1                       [512, 192, 9, 9]          31,104
# │    └─BatchNorm2d: 2-2                  [512, 192, 9, 9]          --
# ├─Sequential: 1-2                        [512, 192, 9, 9]          --
# │    └─ResBlock: 2-3                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-1               [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-2               [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-4                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-3               [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-4               [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-5                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-5               [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-6               [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-6                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-7               [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-8               [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-7                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-9               [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-10              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-8                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-11              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-12              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-9                     [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-13              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-14              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-10                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-15              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-16              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-11                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-17              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-18              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-12                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-19              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-20              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-13                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-21              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-22              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-14                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-23              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-24              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-15                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-25              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-26              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-16                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-27              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-28              [512, 192, 9, 9]          331,968
# │    └─ResBlock: 2-17                    [512, 192, 9, 9]          --
# │    │    └─ConvBlock: 3-29              [512, 192, 9, 9]          331,968
# │    │    └─ConvBlock: 3-30              [512, 192, 9, 9]          331,968
# ├─ConvBlock: 1-3                         [512, 2, 9, 9]            2
# │    └─Conv2d: 2-18                      [512, 2, 9, 9]            384
# │    └─BatchNorm2d: 2-19                 [512, 2, 9, 9]            --
# ├─Linear: 1-4                            [512, 82]                 13,366
# ├─ConvBlock: 1-5                         [512, 1, 9, 9]            1
# │    └─Conv2d: 2-20                      [512, 1, 9, 9]            192
# │    └─BatchNorm2d: 2-21                 [512, 1, 9, 9]            --
# ├─Linear: 1-6                            [512, 256]                20,992
# ├─Linear: 1-7                            [512, 1]                  257
# ==========================================================================================
# Total params: 10,025,530
# Trainable params: 10,025,530
# Non-trainable params: 0
# Total mult-adds (Units.GIGABYTES): 414.11
# ==========================================================================================
# Input size (MB): 2.99
# Forward/backward pass size (MB): 1977.11
# Params size (MB): 40.08
# Estimated Total Size (MB): 2020.18
# ==========================================================================================
